app/graphql/mutations/create_link.rb

INSERT INTO "links" ("url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "hello.com"], ["description", "nunya bussiness"], ["created_at", "2019-07-10 09:22:50.970698"], ["updated_at", "2019-07-10 09:22:50.970698"]]
---
        def resolve(description: nil, url: nil)
            Link.create!(
                description: description,
                url: url
            )