app/graphql/mutations/sign_in_user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mbishai@hello.com"], ["LIMIT", 1]]
---
        def resolve(email: nil)
            return unless email
            user = User.find_by() email: email[:email]