app/graphql/types/query_type.rb

    def specific_link(id:)
      Link.find(id)
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]